# This file should contain all the record creation needed to seed the database with its default values.
# The data can then be loaded with the rails db:seed command (or created alongside the database with db:setup).
#
# Examples:
#
#   movies = Movie.create([{ name: 'Star Wars' }, { name: 'Lord of the Rings' }])
#   Character.create(name: 'Luke', movie: movies.first)

Post.create!(
  title: 'ゲット・アウト',
  story: 'ニューヨークに暮らすアフリカ系アメリカ人の写真家クリスは、ある週末に白人の彼女ローズの実家に招待される。若干の不安とは裏腹に、過剰なまでの歓迎を受けるものの、黒人の使用人がいることに妙な違和感を覚える。その夜、庭を猛スピードで走り去る管理人と窓ガラスに映る自分の姿をじっと見つめる家政婦を目撃し、動揺するクリス。翌日、亡くなったローズの祖父を讃えるパーティに多くの友人が集まるが、何故か白人ばかりで気が滅入ってしまう。そんななか、どこか古風な黒人の若者を発見し、思わず携帯で撮影すると、フラッシュが焚かれた瞬間、彼は鼻から血を流しながら急に豹変し、「出ていけ！」と襲い掛かってくる。“何かがおかしい”と感じたクリスは、ローズと一緒に実家から出ようするが・・・。',
  director: 'ジョーダン・ピール',
  country: 'アメリカ',
  year: '2017',
)
Post.create!(
  title: 'US',
  story: 'アデレードは夫のゲイブ、娘のゾーラ、息子のジェイソンと共に夏休みを過ごす為、幼少期に住んでいた、カリフォルニア州サンタクルーズの家を訪れる。早速、友人達と一緒にビーチへ行くが、不気味な偶然に見舞われた事で、過去の原因不明で未解決なトラウマがフラッシュバックする。やがて、家族の身に恐ろしい事が起こるという妄想を強めていくアデレード。その夜、家の前に自分達とそっくりな“わたしたち”がやってくる・・・。',
  director: 'ジョーダン・ピール',
  country: 'アメリカ',
  year: '2019',
)
Post.create!(
  title: 'ドント・ブリーズ',
  story: '親と決別し街を出るため逃走資金が必要だったロッキーは、恋人のマニーと友人のアレックスと一緒に、大金を隠し持つと噂される盲目の老人宅に強盗に入る。だが目は見えないが超人的な聴覚を持つ老人は、どんな“音”も逃さない<異常者>だった。真っ暗闇の家の中で追い詰められた若者たちは、怪しげな地下室にたどり着く。そこで目にした衝撃的な光景に、ロッキーの悲鳴が鳴り響く――。彼らはここから無傷で《脱出》できるのか―。',
  director: 'フェデ・アルバレス',
  country: 'アメリカ',
  year: '2016',
)
Post.create!(
  title: 'ハッピー・デス・デイ',
  story: '主人公ツリーは、キャンパスの女子寮に暮らすイケてる大学生。遊んでばかりの彼女は、誕生日の朝も見知らぬ男のベッドで頭痛とともに目を覚ます。慌ただしくルーティンをこなし、夜になってパーティに繰り出す道すがら、彼女はマスク姿の殺人鬼に刺し殺される。しかし目を覚ますと、またも誕生日の朝、見知らぬ男のベッドの上にいる。そしてまた同じ 1 日を繰り返し、また殺されてしまった。彼女はエンドレスのタイムループにはまりこんでいたのだ！タイムループを止めるには犯人を見つけることだと気づいたツリーは殺されても、殺されても、立ち向かう。しかし、その先には予想もしない衝撃の事実が待ち受けていた……。',
  director: 'クリストファー・ランドン',
  country: 'アメリカ',
  year: '2017',
)
Post.create!(
  title: '残穢 住んではいけない部屋',
  story: '小説家である「私」のもとに、女子大生の久保さんという読者から、１通の手紙が届く。「今住んでいる部屋で、奇妙な“音”がするんです」好奇心を抑えられず、調査を開始する「私」と久保さん。すると、そのマンションの過去の住人たちが、引っ越し先で、自殺や心中、殺人など、数々の事件を引き起こしていた事実が浮かび上がる。彼らは、なぜ、“音”のするその「部屋」ではなく、別々の「場所」で、不幸な末路をたどったのか。「私」たちは、数十年の時を経た壮大なる戦慄の真相に辿り着き、やがて、さらなる事件に巻き込まれていく——。',
  director: '中村義洋',
  country: '日本',
  year: '2016',
)
Post.create!(
  title: '28日後...',
  story: 'たった1滴の血液で感染し、人間の精神を数秒で破壊する新種のウィルスが発生した。感染者の血管は純粋な激しい怒りで溢れ、人間の声を聞いただけで相手を殺そうと襲いかかる……。28日後、ジムは病院の集中治療室で昏睡状態から目覚める。世界から何もかも消滅してしまったような静寂の中、ジムは生き残った4人の非感染者たちと共に1台のタクシーで旅立つ。未来を救えるわずかな可能性を信じて。しかし、死のウィルスより恐ろしい存在に彼らはまだ気づいていなかった……。',
  director: 'ダニー・ボイル',
  country: 'アメリカ',
  year: '2002',
)
Post.create!(
  title: 'アイ・アム・レジェンド',
  story: 'ロバート・ネビルは優れた科学者だが、彼でさえ、その恐ろしいウイルスを食い止めるすべを知らなかった。なぜか免疫があったネビルは、荒れ果てたニューヨークで――あるいは世界で――ただ１人生き残っている。地球最後の男に、希望はあるのか。',
  director: 'フランシス・ローレンス',
  country: 'アメリカ',
  year: '2007',
)
Post.create!(
  title: 'バイオハザード',
  story: '巨大企業アンブレラ社が地中深くに作り上げた秘密研究所ハイブ。ここで開発中のウィルスが何者かの手によって空気中に漏洩した。メインコンピューターは汚染が地上に拡大するのを防ぐために研究所を封鎖。これによってすべての所員の生命が失われた。アンブレラ社は特殊部隊を派遣するが、ハイブに進入した彼らを待っていたのは、ウィルスがもたらした戦慄すべき光景だった・・・！',
  director: 'ポール・W・S・アンダーソン',
  country: 'アメリカ',
  year: '2002',
)
Post.create!(
  title: 'ゾンビランド',
  story: 'ある日突然、それは起こった。謎の新型ウィルスに感染した者がゾンビと化し、生きた人間を次々と襲ってその肉を喰らい始めたのだ。そのウィルスはパンデミック（爆発感染）を引き起こし、猛烈な勢いで全世界へと広まっていった。それから数ヶ月、地球上は人喰いゾンビで埋め尽くされ、人類はほぼ絶滅状態となった。アメリカに住む人間の大半もこのウィルスに感染し、アメリカはいまやまさに"ゾンビ合衆国（ランド）"となっていた。 大学生だったコロンバス（ジェシー・アイゼンバーグ）はテキサス州ガーランドでも数少ない生き残りの１人だった。臆病で胃腸が弱く、引きこもりで友達もいないネットゲームおたくで、当然童貞の彼は、"ゾンビの世界で生き残るための32のルール"を作り、それを慎重に実践して生き延びてきた。',
  director: 'ルーベン・フライシャー',
  country: 'アメリカ',
  year: '2009',
)
Post.create!(
  title: 'レック',
  story: 'レポーターのアンヘラ（マニュエラ・ヴェラスコ）は、あるアパートに出動する消防団に同行取材を行う。現場にいたのは血まみれの老婆。老婆は警官にかみ付き、建物は外から封鎖されてしまう。救出に来た衛生士の口から、この建物で発生したと思われる人や動物を凶暴にする病原菌の存在を知らされ……。',
  director: 'ジャウマ・バラゲロ/パコ・プラサ',
  country: 'アメリカ',
  year: '2007',
)




Post.create!(
  title: 'ドーン・オブ・ザ・デッド',
  story: 'アメリカのワシントン州エベレット。看護婦のアナ（サラ・ポーリー）は仕事を終えて帰った翌朝、人間たちが凶暴化し、機敏な動きで次々と人間を襲う光景を目にする。パニックに陥った彼女は、夢中で自動車に乗り込み、町を離れようとするが……。',
  director: 'ザック・スナイダー',
  country: 'アメリカ',
  year: '2004',
)
Image.create!(
  pic: 'https://iwiz-movies.c.yimg.jp/im_siggEMrfYWFzFqFn4fWCM1zZGg---x680/c/movies/pict/p/p/88/e0/142241_01.jpg',
  post_id: '11',
)
# Post.create!(
#   title: 'ハウス・オブ・ザ・デッド',
#   story: 'アリシアたち5人の若者は、無人島で秘密のレイヴ・パーティーがあると聞き、島に上陸する。しかし会場には無残な死体の山が……。この島にはなぜかゾンビが生息し、人間たちを次々と襲っていたのだ。',
#   director: 'ウーヴェ・ボル',
#   country: 'アメリカ/ドイツ/カナダ',
#   year: '2003',
# )
# Post.create!(
#   title: 'デイ・オブ・ザ・デッド',
#   story: 'アメリカ・コロラド州レッドヴィルで24時間の検疫隔離演習の命令が下され、ローズ大尉（ヴィング・レイムス）率いる州兵が道路封鎖を開始する。この街出身のクロス伍長（ミーナ・スヴァーリ）は町内の巡回に出かける。実家に立ち寄った彼女は、母親が高熱を出しているのを知り病院に連れて行くが、ロビーは診察を待つ人々でごった返していた。',
#   director: 'スティーヴ・マイナー',
#   country: 'アメリカ',
#   year: '2008',
# )
# Post.create!(
#   title: 'ランド・オブ・ザ・デッド',
#   story: 'ある日突然死んだはずの人間が次々とゾンビになり、そのうちの一人が知恵をつけ始めた。銃や、器具を使うことを覚えたゾンビたちにライリー（サイモン・ベイカー）やわずかな生存者たちは窮地に追い込まれる。',
#   director: 'ジョージ・A・ロメロ',
#   country: 'アメリカ/カナダ/フランス',
#   year: '2005',
# )
# Post.create!(
#   title: '28週後...',
#   story: '人間を凶暴化させる“RAGEウイルス”の猛威が収まり、復興計画が始まったイギリス。スペイン旅行中でウイルスの難を逃れたタミー（イモジェン・プーツ）とアンディ（マッキントッシュ・マグルトン）の姉弟は、父親のドン（ロバート・カーライル）と再会を果たす。しかし、感染を逃れたドンには子どもたちに言えない秘密があった。',
#   director: 'フアン・カルロス・フレスナディージョ',
#   country: 'イギリス/スペイン',
#   year: '2007',
# )
# Post.create!(
#   title: '死霊のはらわた',
#   story: 'うっそうとした山奥にたたずむ小屋を訪れた、ミア（ジェーン・レヴィ）をはじめとする5人の若者。小屋で「死者の書」という不気味な書物を見つけた彼らは、はからずも邪悪な死霊をよみがえらせてしまう。解き放たれた死霊はミアにとりつき、若者たちに襲い掛かる。おぞましい姿に変ぼうしたミアと戦いながら山から脱出しようとする若者たちだが、死霊の力によって行く手を阻まれてしまう。助けを呼ぶこともできぬまま、一人、また一人と、彼らは死霊にとりつかれ……。',
#   director: 'フェデ・アルバレス',
#   country: 'アメリカ',
#   year: '2013',
# )
# Post.create!(
#   title: 'バタリアン',
#   story: '製薬会社に勤め始めたフレディと先輩のフランク。社内に保管されている軍のゾンビ保管容器を開けて、特殊な薬品を浴びてしまいます。社長を呼び出して証拠隠滅を図りますが、特殊な薬品の影響でバタリアンになる人、コールタール漬けのゾンビのタールマン、上半身だけの老婆オバンバたちが襲い掛かり…',
#   director: 'ダン・オバノン',
#   country: 'アメリカ',
#   year: '1985',
# )
# Post.create!(
#   title: 'アイアムアヒーロー',
#   story: '謎のウィルスが蔓延し、ZQN（ゾキュン）と呼ばれるゾンビだらけになった日本。漫画家アシスタントをしていた鈴木英雄は、標高の高い場所では感染しないという噂を聞いて富士山に向かいます。途中で出会った女子高生の比呂美、元看護師の藪と助け合うようになる英雄。彼らは生き延びることができるのでしょうか。',
#   director: '佐藤信介',
#   country: '日本',
#   year: '2015',
# )
# Post.create!(
#   title: 'ワールド・ウォーZ',
#   story: 'その日、ジェリー（ブラッド・ピット）と妻、２人の娘を載せた車は渋滞にはまっていた。一向に動かない車列に、これがいつもの交通渋滞でないことに気付くが、次の瞬間、背後から猛スピードで暴走するトラックが迫ってくる。必死で家族を守り、その場から逃げだしたジェリー。全世界では爆発的に拡大する“謎のウイルス”によって感染者は増加し続け、大混乱に陥っていた。元国連捜査官として世界各国を飛び回ったジェリーに事態を収束させるべく任務が下る。怯える家族のそばにいたいという思いと、世界を救わなければならないという使命の狭間で、ジェリーは究極の選択を迫られる。感染の速度は加速する一方で、人類に残された時間はわずかだった―。',
#   director: 'マーク・フォースター',
#   country: 'アメリカ',
#   year: '2013',
# )
# Post.create!(
#   title: 'ブレインデッド',
#   story: 'アフリカ奥地で発見された未知の生物ラット・モンキーに噛まれたためにゾンビ化してしまった母親。息子のマザコン青年はなんとか事態の収拾を図るが、その間にも犠牲者の数は増えていく……。',
#   director: 'ピーター・ジャクソン',
#   country: 'ニュージーランド',
#   year: '1992',
# )
# Post.create!(
#   title: '新感染 ファイナル・エクスプレス',
#   story: 'ソウル発プサン⾏きの⾼速鉄道KTXの⾞内で突如起こった感染爆発。疾⾛する密室と化した列⾞の中で凶暴化する感染者たち。感染すなわち、死ー。そんな列⾞に偶然乗り合わせたのは、妻のもとへ向かう⽗と幼い娘、出産間近の妻とその夫、そして⾼校⽣の恋⼈同⼠・・・果たして彼らは安全な終着駅にたどり着くことができるのか―？⽬的地まではあと2時間、時速300km、絶体絶命のサバイバル。愛するものを守るため、決死の闘いが今はじまる。彼らの運命の⾏き先は・・・。',
#   director: 'ヨン・サンホ',
#   country: '韓国',
#   year: '2016',
# )
# Post.create!(
#   title: 'カメラを止めるな！',
#   story: 'とある自主映画の撮影隊が山奥の廃墟でゾンビ映画を撮影していた。本物を求める監督は中々OKを出さずテイクは42テイクに達する。そんな中、撮影隊に本物のゾンビが襲いかかる！大喜びで撮影を続ける監督、次々とゾンビ化していく撮影隊の面々。映画史をぬり変えるワンカットゾンビサバイバル！……を撮ったヤツらの話。',
#   director: '上田慎一郎',
#   country: '日本',
#   year: '2017',
# )
# Post.create!(
#   title: '',
#   story: '',
#   director: '',
#   country: 'アメリカ',
#   year: '2004',
# )
# Post.create!(
#   title: '',
#   story: '',
#   director: '',
#   country: 'アメリカ',
#   year: '2004',
# )
# Post.create!(
#   title: '',
#   story: '',
#   director: '',
#   country: 'アメリカ',
#   year: '2004',
# )
# Post.create!(
#   title: '',
#   story: '',
#   director: '',
#   country: 'アメリカ',
#   year: '2004',
# )
# Post.create!(
#   title: '',
#   story: '',
#   director: '',
#   country: 'アメリカ',
#   year: '2004',
# )
# Post.create!(
#   title: '',
#   story: '',
#   director: '',
#   country: 'アメリカ',
#   year: '2004',
# )
# Post.create!(
#   title: '',
#   story: '',
#   director: '',
#   country: 'アメリカ',
#   year: '2004',
# )
# Post.create!(
#   title: '',
#   story: '',
#   director: '',
#   country: 'アメリカ',
#   year: '2004',
# )


Image.create!(
  pic: 'https://iwiz-movies.c.yimg.jp/im_siggnmlxuAjCcwdIAo4Sd.k7eQ---x680/c/movies/pict/p/p/74/24/173644_01.jpg',
  post_id: '1',
)
Image.create!(
  pic: 'https://theriver.jp/wp-content/uploads/2019/05/Us_poster_fix_s-1024x1449.jpg',
  post_id: '2',
)
Image.create!(
  pic: 'https://iwiz-movies.c.yimg.jp/im_siggn3EMfTqGMvw3QhSqOmue3Q---x680/c/movies/pict/p/p/05/27/171195_01.jpg',
  post_id: '3',
)
Image.create!(
  pic: 'https://iwiz-movies.c.yimg.jp/im_siggmWcNKQ6IpLU166BWns0IcA---x680/c/movies/pict/p/p/18/89/173419_01.jpg',
  post_id: '4',
)
Image.create!(
  pic: 'https://iwiz-movies.c.yimg.jp/im_siggHYWSEkU9FFtYnqYjqHVInw---x680/c/movies/pict/p/p/15/2b/168033_02.jpg',
  post_id: '5',
)
Image.create!(
  pic: 'https://musicart.xboxlive.com/7/74c91100-0000-0000-0000-000000000002/504/image.jpg?w=1920&h=1080',
  post_id: '6',
)
Image.create!(
  pic: 'https://iwiz-movies.c.yimg.jp/im_siggXh9AiZQZ3URBoeFpomEmQw---x680/c/movies/pict/p/p/5e/c7/146687_01.jpg',
  post_id: '7',
)
Image.create!(
  pic: 'https://i.pinimg.com/originals/6c/8e/3f/6c8e3f557bae5667577cfb9e05a1a527.jpg',
  post_id: '8',
)
Image.create!(
  pic: 'https://eiga.k-img.com/images/movie/54435/photo/478c040c077971c4.jpg?',
  post_id: '9',
)
Image.create!(
  pic: 'https://eiga.k-img.com/images/movie/53553/photo/a87f11377ad1e03f.jpg?1495095098',
  post_id: '10',
)

Genre.create!(
  genre: 'ゾンビ',
)
Genre.create!(
  genre: 'サイコ',
)
Genre.create!(
  genre: 'スリラー',
)
Genre.create!(
  genre: 'モンスター',
)
Genre.create!(
  genre: 'オカルト',
)
Genre.create!(
  genre: 'Jホラー',
)
Genre.create!(
  genre: 'グロテスク',
)


# INSERT INTO post_genres (post_id, genre_id) VALUES (1, 3);


# Post_genre.create!(
#   post_id: '2',
#   genre_id: '3',
# )
# Post_genre.create!(
#   post_id: '3',
#   genre_id: '3',
# )
# Post_genre.create!(
#   post_id: '4',
#   genre_id: '3',
# )
# Post_genre.create!(
#   post_id: '5',
#   genre_id: '6',
# )
# Post_genre.create!(
#   post_id: '6',
#   genre_id: '1',
# )
# Post_genre.create!(
#   post_id: 7,
#   genre_id: '1',
# )
# Post_genre.create!(
#   post_id: '8',
#   genre_id: '1',
# )
# Post_genre.create!(
#   post_id: '9',
#   genre_id: '1',
# )
# Post_genre.create!(
#   post_id: '10',
#   genre_id: '1',
# )
